
#### :building_construction: Terraform Plan
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.device["R10"].netbox_available_prefix.tunnels_v4["CR6"] will be created
  + resource "netbox_available_prefix" "tunnels_v4" {
      + description      = "Tunnel from CR6 to R10 (In der Nießdonk)"
      + id               = (known after apply)
      + parent_prefix_id = 126
      + prefix           = (known after apply)
      + prefix_length    = 31
      + role_id          = 1
      + status           = "active"
      + tenant_id        = 2
    }

  # module.device["R10"].netbox_available_prefix.tunnels_v6["CR6"] will be created
  + resource "netbox_available_prefix" "tunnels_v6" {
      + description      = "Tunnel from CR6 to R10 (In der Nießdonk)"
      + id               = (known after apply)
      + parent_prefix_id = 132
      + prefix           = (known after apply)
      + prefix_length    = 64
      + role_id          = 1
      + status           = "active"
      + tenant_id        = 2
    }

  # module.device["R10"].netbox_device_interface.core["CR6"] will be created
  + resource "netbox_device_interface" "core" {
      + description = "Tunnel to R10 (In der Nießdonk)"
      + device_id   = 607
      + enabled     = true
      + id          = (known after apply)
      + label       = "Tunnel R10"
      + mtu         = 1476
      + name        = (known after apply)
      + type        = "virtual"
    }

  # module.device["R10"].netbox_device_interface.tunnels["CR6"] will be created
  + resource "netbox_device_interface" "tunnels" {
      + description = "Tunnel to CR6"
      + device_id   = 91
      + enabled     = true
      + id          = (known after apply)
      + label       = "Tunnel CR6"
      + name        = "tun3"
      + type        = "virtual"
    }

  # module.device["R10"].netbox_ip_address.local_tunnel_address_v4["CR6"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v4" {
      + description           = "Peer address of R10 for CR6"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R10"].netbox_ip_address.local_tunnel_address_v6["CR6"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v6" {
      + description           = "Peer address of R10 for CR6"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R10"].netbox_ip_address.remote_tunnel_address_v4["CR6"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v4" {
      + description           = "Peer address of CR6 for R10"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R10"].netbox_ip_address.remote_tunnel_address_v6["CR6"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v6" {
      + description           = "Peer address of CR6 for R10"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R10"].netbox_vpn_tunnel.core["CR6"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR6 to R10 (In der Nießdonk)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR6-R10"
      + status          = "active"
      + tunnel_group_id = 1
    }

  # module.device["R10"].netbox_vpn_tunnel_termination.core_device["CR6"] will be created
  + resource "netbox_vpn_tunnel_termination" "core_device" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = 816
      + role                  = "peer"
      + tunnel_id             = (known after apply)
    }

  # module.device["R10"].netbox_vpn_tunnel_termination.site["CR6"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = 294
      + role                  = "peer"
      + tunnel_id             = (known after apply)
    }

  # module.device["R14"].netbox_available_prefix.tunnels_v4["CR6"] will be created
  + resource "netbox_available_prefix" "tunnels_v4" {
      + description      = "Tunnel from CR6 to R14 (Höherweg)"
      + id               = (known after apply)
      + parent_prefix_id = 126
      + prefix           = (known after apply)
      + prefix_length    = 31
      + role_id          = 1
      + status           = "active"
      + tenant_id        = 2
    }

  # module.device["R14"].netbox_available_prefix.tunnels_v6["CR6"] will be created
  + resource "netbox_available_prefix" "tunnels_v6" {
      + description      = "Tunnel from CR6 to R14 (Höherweg)"
      + id               = (known after apply)
      + parent_prefix_id = 132
      + prefix           = (known after apply)
      + prefix_length    = 64
      + role_id          = 1
      + status           = "active"
      + tenant_id        = 2
    }

  # module.device["R14"].netbox_device_interface.core["CR6"] will be created
  + resource "netbox_device_interface" "core" {
      + description = "Tunnel to R14 (Höherweg)"
      + device_id   = 607
      + enabled     = true
      + id          = (known after apply)
      + label       = "Tunnel R14"
      + mtu         = 1476
      + name        = (known after apply)
      + type        = "virtual"
    }

  # module.device["R14"].netbox_device_interface.tunnels["CR6"] will be created
  + resource "netbox_device_interface" "tunnels" {
      + description = "Tunnel to CR6"
      + device_id   = 310
      + enabled     = true
      + id          = (known after apply)
      + label       = "Tunnel CR6"
      + name        = "tun3"
      + type        = "virtual"
    }

  # module.device["R14"].netbox_ip_address.local_tunnel_address_v4["CR6"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v4" {
      + description           = "Peer address of R14 for CR6"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R14"].netbox_ip_address.local_tunnel_address_v6["CR6"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v6" {
      + description           = "Peer address of R14 for CR6"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R14"].netbox_ip_address.remote_tunnel_address_v4["CR6"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v4" {
      + description           = "Peer address of CR6 for R14"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R14"].netbox_ip_address.remote_tunnel_address_v6["CR6"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v6" {
      + description           = "Peer address of CR6 for R14"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R14"].netbox_vpn_tunnel.core["CR6"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR6 to R14 (Höherweg)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR6-R14"
      + status          = "active"
      + tunnel_group_id = 1
    }

  # module.device["R14"].netbox_vpn_tunnel_termination.core_device["CR6"] will be created
  + resource "netbox_vpn_tunnel_termination" "core_device" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = 816
      + role                  = "peer"
      + tunnel_id             = (known after apply)
    }

  # module.device["R14"].netbox_vpn_tunnel_termination.site["CR6"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = 331
      + role                  = "peer"
      + tunnel_id             = (known after apply)
    }

  # module.device["R15"].netbox_available_prefix.tunnels_v4["CR6"] will be created
  + resource "netbox_available_prefix" "tunnels_v4" {
      + description      = "Tunnel from CR6 to R15 (GatherWeg)"
      + id               = (known after apply)
      + parent_prefix_id = 126
      + prefix           = (known after apply)
      + prefix_length    = 31
      + role_id          = 1
      + status           = "active"
      + tenant_id        = 2
    }

  # module.device["R15"].netbox_available_prefix.tunnels_v6["CR6"] will be created
  + resource "netbox_available_prefix" "tunnels_v6" {
      + description      = "Tunnel from CR6 to R15 (GatherWeg)"
      + id               = (known after apply)
      + parent_prefix_id = 132
      + prefix           = (known after apply)
      + prefix_length    = 64
      + role_id          = 1
      + status           = "active"
      + tenant_id        = 2
    }

  # module.device["R15"].netbox_device_interface.core["CR6"] will be created
  + resource "netbox_device_interface" "core" {
      + description = "Tunnel to R15 (GatherWeg)"
      + device_id   = 607
      + enabled     = true
      + id          = (known after apply)
      + label       = "Tunnel R15"
      + mtu         = 1476
      + name        = (known after apply)
      + type        = "virtual"
    }

  # module.device["R15"].netbox_device_interface.tunnels["CR6"] will be created
  + resource "netbox_device_interface" "tunnels" {
      + description = "Tunnel to CR6"
      + device_id   = 311
      + enabled     = true
      + id          = (known after apply)
      + label       = "Tunnel CR6"
      + name        = "tun3"
      + type        = "virtual"
    }

  # module.device["R15"].netbox_ip_address.local_tunnel_address_v4["CR6"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v4" {
      + description           = "Peer address of R15 for CR6"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R15"].netbox_ip_address.local_tunnel_address_v6["CR6"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v6" {
      + description           = "Peer address of R15 for CR6"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R15"].netbox_ip_address.remote_tunnel_address_v4["CR6"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v4" {
      + description           = "Peer address of CR6 for R15"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R15"].netbox_ip_address.remote_tunnel_address_v6["CR6"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v6" {
      + description           = "Peer address of CR6 for R15"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R15"].netbox_vpn_tunnel.core["CR6"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR6 to R15 (GatherWeg)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR6-R15"
      + status          = "active"
      + tunnel_group_id = 1
    }

  # module.device["R15"].netbox_vpn_tunnel_termination.core_device["CR6"] will be created
  + resource "netbox_vpn_tunnel_termination" "core_device" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = 816
      + role                  = "peer"
      + tunnel_id             = (known after apply)
    }

  # module.device["R15"].netbox_vpn_tunnel_termination.site["CR6"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = 559
      + role                  = "peer"
      + tunnel_id             = (known after apply)
    }

  # module.device["R18"].netbox_available_prefix.tunnels_v4["CR6"] will be created
  + resource "netbox_available_prefix" "tunnels_v4" {
      + description      = "Tunnel from CR6 to R18 (Haus der Jugend)"
      + id               = (known after apply)
      + parent_prefix_id = 126
      + prefix           = (known after apply)
      + prefix_length    = 31
      + role_id          = 1
      + status           = "active"
      + tenant_id        = 2
    }

  # module.device["R18"].netbox_available_prefix.tunnels_v6["CR6"] will be created
  + resource "netbox_available_prefix" "tunnels_v6" {
      + description      = "Tunnel from CR6 to R18 (Haus der Jugend)"
      + id               = (known after apply)
      + parent_prefix_id = 132
      + prefix           = (known after apply)
      + prefix_length    = 64
      + role_id          = 1
      + status           = "active"
      + tenant_id        = 2
    }

  # module.device["R18"].netbox_device_interface.core["CR6"] will be created
  + resource "netbox_device_interface" "core" {
      + description = "Tunnel to R18 (Haus der Jugend)"
      + device_id   = 607
      + enabled     = true
      + id          = (known after apply)
      + label       = "Tunnel R18"
      + mtu         = 1476
      + name        = (known after apply)
      + type        = "virtual"
    }

  # module.device["R18"].netbox_device_interface.tunnels["CR6"] will be created
  + resource "netbox_device_interface" "tunnels" {
      + description = "Tunnel to CR6"
      + device_id   = 418
      + enabled     = true
      + id          = (known after apply)
      + label       = "Tunnel CR6"
      + name        = "tun3"
      + type        = "virtual"
    }

  # module.device["R18"].netbox_ip_address.local_tunnel_address_v4["CR6"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v4" {
      + description           = "Peer address of R18 for CR6"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R18"].netbox_ip_address.local_tunnel_address_v6["CR6"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v6" {
      + description           = "Peer address of R18 for CR6"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R18"].netbox_ip_address.remote_tunnel_address_v4["CR6"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v4" {
      + description           = "Peer address of CR6 for R18"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R18"].netbox_ip_address.remote_tunnel_address_v6["CR6"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v6" {
      + description           = "Peer address of CR6 for R18"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R18"].netbox_vpn_tunnel.core["CR6"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR6 to R18 (Haus der Jugend)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR6-R18"
      + status          = "active"
      + tunnel_group_id = 1
    }

  # module.device["R18"].netbox_vpn_tunnel_termination.core_device["CR6"] will be created
  + resource "netbox_vpn_tunnel_termination" "core_device" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = 816
      + role                  = "peer"
      + tunnel_id             = (known after apply)
    }

  # module.device["R18"].netbox_vpn_tunnel_termination.site["CR6"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = 643
      + role                  = "peer"
      + tunnel_id             = (known after apply)
    }

  # module.device["R19"].netbox_available_prefix.tunnels_v4["CR6"] will be created
  + resource "netbox_available_prefix" "tunnels_v4" {
      + description      = "Tunnel from CR6 to R19 (Ariadne)"
      + id               = (known after apply)
      + parent_prefix_id = 126
      + prefix           = (known after apply)
      + prefix_length    = 31
      + role_id          = 1
      + status           = "active"
      + tenant_id        = 2
    }

  # module.device["R19"].netbox_available_prefix.tunnels_v6["CR6"] will be created
  + resource "netbox_available_prefix" "tunnels_v6" {
      + description      = "Tunnel from CR6 to R19 (Ariadne)"
      + id               = (known after apply)
      + parent_prefix_id = 132
      + prefix           = (known after apply)
      + prefix_length    = 64
      + role_id          = 1
      + status           = "active"
      + tenant_id        = 2
    }

  # module.device["R19"].netbox_device_interface.core["CR6"] will be created
  + resource "netbox_device_interface" "core" {
      + description = "Tunnel to R19 (Ariadne)"
      + device_id   = 607
      + enabled     = true
      + id          = (known after apply)
      + label       = "Tunnel R19"
      + mtu         = 1476
      + name        = (known after apply)
      + type        = "virtual"
    }

  # module.device["R19"].netbox_device_interface.tunnels["CR6"] will be created
  + resource "netbox_device_interface" "tunnels" {
      + description = "Tunnel to CR6"
      + device_id   = 419
      + enabled     = true
      + id          = (known after apply)
      + label       = "Tunnel CR6"
      + name        = "tun3"
      + type        = "virtual"
    }

  # module.device["R19"].netbox_ip_address.local_tunnel_address_v4["CR6"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v4" {
      + description           = "Peer address of R19 for CR6"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R19"].netbox_ip_address.local_tunnel_address_v6["CR6"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v6" {
      + description           = "Peer address of R19 for CR6"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R19"].netbox_ip_address.remote_tunnel_address_v4["CR6"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v4" {
      + description           = "Peer address of CR6 for R19"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R19"].netbox_ip_address.remote_tunnel_address_v6["CR6"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v6" {
      + description           = "Peer address of CR6 for R19"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R19"].netbox_vpn_tunnel.core["CR6"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR6 to R19 (Ariadne)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR6-R19"
      + status          = "active"
      + tunnel_group_id = 1
    }

  # module.device["R19"].netbox_vpn_tunnel_termination.core_device["CR6"] will be created
  + resource "netbox_vpn_tunnel_termination" "core_device" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = 816
      + role                  = "peer"
      + tunnel_id             = (known after apply)
    }

  # module.device["R19"].netbox_vpn_tunnel_termination.site["CR6"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = 512
      + role                  = "peer"
      + tunnel_id             = (known after apply)
    }

  # module.device["R20"].netbox_available_prefix.tunnels_v4["CR6"] will be created
  + resource "netbox_available_prefix" "tunnels_v4" {
      + description      = "Tunnel from CR6 to R20 (Moskauer Straße)"
      + id               = (known after apply)
      + parent_prefix_id = 126
      + prefix           = (known after apply)
      + prefix_length    = 31
      + role_id          = 1
      + status           = "active"
      + tenant_id        = 2
    }

  # module.device["R20"].netbox_available_prefix.tunnels_v6["CR6"] will be created
  + resource "netbox_available_prefix" "tunnels_v6" {
      + description      = "Tunnel from CR6 to R20 (Moskauer Straße)"
      + id               = (known after apply)
      + parent_prefix_id = 132
      + prefix           = (known after apply)
      + prefix_length    = 64
      + role_id          = 1
      + status           = "active"
      + tenant_id        = 2
    }

  # module.device["R20"].netbox_device_interface.core["CR6"] will be created
  + resource "netbox_device_interface" "core" {
      + description = "Tunnel to R20 (Moskauer Straße)"
      + device_id   = 607
      + enabled     = true
      + id          = (known after apply)
      + label       = "Tunnel R20"
      + mtu         = 1476
      + name        = (known after apply)
      + type        = "virtual"
    }

  # module.device["R20"].netbox_device_interface.tunnels["CR6"] will be created
  + resource "netbox_device_interface" "tunnels" {
      + description = "Tunnel to CR6"
      + device_id   = 427
      + enabled     = true
      + id          = (known after apply)
      + label       = "Tunnel CR6"
      + name        = "tun3"
      + type        = "virtual"
    }

  # module.device["R20"].netbox_ip_address.local_tunnel_address_v4["CR6"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v4" {
      + description           = "Peer address of R20 for CR6"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R20"].netbox_ip_address.local_tunnel_address_v6["CR6"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v6" {
      + description           = "Peer address of R20 for CR6"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R20"].netbox_ip_address.remote_tunnel_address_v4["CR6"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v4" {
      + description           = "Peer address of CR6 for R20"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R20"].netbox_ip_address.remote_tunnel_address_v6["CR6"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v6" {
      + description           = "Peer address of CR6 for R20"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R20"].netbox_vpn_tunnel.core["CR6"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR6 to R20 (Moskauer Straße)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR6-R20"
      + status          = "active"
      + tunnel_group_id = 1
    }

  # module.device["R20"].netbox_vpn_tunnel_termination.core_device["CR6"] will be created
  + resource "netbox_vpn_tunnel_termination" "core_device" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = 816
      + role                  = "peer"
      + tunnel_id             = (known after apply)
    }

  # module.device["R20"].netbox_vpn_tunnel_termination.site["CR6"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = 727
      + role                  = "peer"
      + tunnel_id             = (known after apply)
    }

  # module.device["R9"].netbox_available_prefix.tunnels_v4["CR6"] will be created
  + resource "netbox_available_prefix" "tunnels_v4" {
      + description      = "Tunnel from CR6 to R9 (Völklinger Straße)"
      + id               = (known after apply)
      + parent_prefix_id = 126
      + prefix           = (known after apply)
      + prefix_length    = 31
      + role_id          = 1
      + status           = "active"
      + tenant_id        = 2
    }

  # module.device["R9"].netbox_available_prefix.tunnels_v6["CR6"] will be created
  + resource "netbox_available_prefix" "tunnels_v6" {
      + description      = "Tunnel from CR6 to R9 (Völklinger Straße)"
      + id               = (known after apply)
      + parent_prefix_id = 132
      + prefix           = (known after apply)
      + prefix_length    = 64
      + role_id          = 1
      + status           = "active"
      + tenant_id        = 2
    }

  # module.device["R9"].netbox_device_interface.core["CR6"] will be created
  + resource "netbox_device_interface" "core" {
      + description = "Tunnel to R9 (Völklinger Straße)"
      + device_id   = 607
      + enabled     = true
      + id          = (known after apply)
      + label       = "Tunnel R9"
      + mtu         = 1476
      + name        = (known after apply)
      + type        = "virtual"
    }

  # module.device["R9"].netbox_device_interface.tunnels["CR6"] will be created
  + resource "netbox_device_interface" "tunnels" {
      + description = "Tunnel to CR6"
      + device_id   = 90
      + enabled     = true
      + id          = (known after apply)
      + label       = "Tunnel CR6"
      + name        = "tun3"
      + type        = "virtual"
    }

  # module.device["R9"].netbox_ip_address.local_tunnel_address_v4["CR6"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v4" {
      + description           = "Peer address of R9 for CR6"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R9"].netbox_ip_address.local_tunnel_address_v6["CR6"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v6" {
      + description           = "Peer address of R9 for CR6"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R9"].netbox_ip_address.remote_tunnel_address_v4["CR6"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v4" {
      + description           = "Peer address of CR6 for R9"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R9"].netbox_ip_address.remote_tunnel_address_v6["CR6"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v6" {
      + description           = "Peer address of CR6 for R9"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R9"].netbox_vpn_tunnel.core["CR6"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR6 to R9 (Völklinger Straße)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR6-R9"
      + status          = "active"
      + tunnel_group_id = 1
    }

  # module.device["R9"].netbox_vpn_tunnel_termination.core_device["CR6"] will be created
  + resource "netbox_vpn_tunnel_termination" "core_device" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = 816
      + role                  = "peer"
      + tunnel_id             = (known after apply)
    }

  # module.device["R9"].netbox_vpn_tunnel_termination.site["CR6"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = 261
      + role                  = "peer"
      + tunnel_id             = (known after apply)
    }

  # module.tunnel_interfaces["CR6"].terraform_data.ifnum["R10"] will be created
  + resource "terraform_data" "ifnum" {
      + id     = (known after apply)
      + input  = (known after apply)
      + output = (known after apply)
    }

  # module.tunnel_interfaces["CR6"].terraform_data.ifnum["R14"] will be created
  + resource "terraform_data" "ifnum" {
      + id     = (known after apply)
      + input  = (known after apply)
      + output = (known after apply)
    }

  # module.tunnel_interfaces["CR6"].terraform_data.ifnum["R15"] will be created
  + resource "terraform_data" "ifnum" {
      + id     = (known after apply)
      + input  = (known after apply)
      + output = (known after apply)
    }

  # module.tunnel_interfaces["CR6"].terraform_data.ifnum["R18"] will be created
  + resource "terraform_data" "ifnum" {
      + id     = (known after apply)
      + input  = (known after apply)
      + output = (known after apply)
    }

  # module.tunnel_interfaces["CR6"].terraform_data.ifnum["R19"] will be created
  + resource "terraform_data" "ifnum" {
      + id     = (known after apply)
      + input  = (known after apply)
      + output = (known after apply)
    }

  # module.tunnel_interfaces["CR6"].terraform_data.ifnum["R20"] will be created
  + resource "terraform_data" "ifnum" {
      + id     = (known after apply)
      + input  = (known after apply)
      + output = (known after apply)
    }

  # module.tunnel_interfaces["CR6"].terraform_data.ifnum["R9"] will be created
  + resource "terraform_data" "ifnum" {
      + id     = (known after apply)
      + input  = (known after apply)
      + output = (known after apply)
    }

  # module.tunnel_interfaces["CR6"].terraform_data.targets_hash["R10"] will be created
  + resource "terraform_data" "targets_hash" {
      + id     = (known after apply)
      + input  = "06544f10a22d4d3c70f7439e79efea782670ef9d"
      + output = (known after apply)
    }

  # module.tunnel_interfaces["CR6"].terraform_data.targets_hash["R14"] will be created
  + resource "terraform_data" "targets_hash" {
      + id     = (known after apply)
      + input  = "06544f10a22d4d3c70f7439e79efea782670ef9d"
      + output = (known after apply)
    }

  # module.tunnel_interfaces["CR6"].terraform_data.targets_hash["R15"] will be created
  + resource "terraform_data" "targets_hash" {
      + id     = (known after apply)
      + input  = "06544f10a22d4d3c70f7439e79efea782670ef9d"
      + output = (known after apply)
    }

  # module.tunnel_interfaces["CR6"].terraform_data.targets_hash["R18"] will be created
  + resource "terraform_data" "targets_hash" {
      + id     = (known after apply)
      + input  = "06544f10a22d4d3c70f7439e79efea782670ef9d"
      + output = (known after apply)
    }

  # module.tunnel_interfaces["CR6"].terraform_data.targets_hash["R19"] will be created
  + resource "terraform_data" "targets_hash" {
      + id     = (known after apply)
      + input  = "06544f10a22d4d3c70f7439e79efea782670ef9d"
      + output = (known after apply)
    }

  # module.tunnel_interfaces["CR6"].terraform_data.targets_hash["R20"] will be created
  + resource "terraform_data" "targets_hash" {
      + id     = (known after apply)
      + input  = "06544f10a22d4d3c70f7439e79efea782670ef9d"
      + output = (known after apply)
    }

  # module.tunnel_interfaces["CR6"].terraform_data.targets_hash["R9"] will be created
  + resource "terraform_data" "targets_hash" {
      + id     = (known after apply)
      + input  = "06544f10a22d4d3c70f7439e79efea782670ef9d"
      + output = (known after apply)
    }

Plan: 91 to add, 0 to change, 0 to destroy.
```